
def area(a):
    """
        Вычисляет площадь квадрата по заданной стороне.

        Параметры:
        a (float) - Длина стороны квадрата.

        Возвращаемое значение:
        float: Площадь квадрата.

        Пример вызова:
        area(4) - Вернёт площадь квадрата со стороной 4
        """
    return a * a


def perimeter(a):
    """
        Вычисляет периметр квадрата по заданной стороне.

        Параметры:
        a (float) - Длина стороны квадрата.

        Возвращаемое значение:
        float: Периметр квадрата.

        Пример вызова:
        perimeter(4) - Вернёт периметр квадрата со стороной 4
        """
    return 4 * a
